import React, { Component } from "react";
import { Wrapper } from "./style";
import HeaderCommon from "../common/header";

class ServiceAgreement extends Component {
  render() {
    return (
      <Wrapper>
        <HeaderCommon />
        <div className="content">
          <h1 className="title">用 户 服 务 协 议</h1>
          <h1>一、特别提示</h1>
          <p>
            本用户协议双方为青岛和盛天元信息技术有限公司（以下简称“和盛天元”）与和盛天元的登录用户，本协议具有合同效力。请用户仔细阅读以下全部内容。用户应当同意本协议的全部条款并按照页面上的提示完成全部的登录程序。用户完成登录程序，视为完全了解并接受本服务条款的全部内容。
          </p>
          <h1>二、服务条款的确认和接受</h1>
          <p>
            1．和盛天元的各项网络服务的所有权、运营权，以及复制传播权等归和盛天元所有。和盛天元提供的服务将完全按照其发布的章程、服务条款和操作规则执行。用户必须事先认真阅读本服务条款中的各条款，必须完全同意所有服务条款并完成登录程序。
          </p>
          <p>
            2．和盛天元有权根据实际情况随时修改本服务条款，并在相关网站页面上提示修改内容。用户若继续使用和盛天元所提供的网络服务，视为同意并接受变更后的服务条款。
          </p>
          <h1>三、用户的账号，密码和安全性</h1>
          <p>
            1．用户务必确保登录用户名及密码的安全性。如果丢失，造成的损失将由本人承担全部后果。用户对利用该用户名及密码所进行的一切活动负全部责任，因此所衍生的任何损失或损害，和盛天元不承担何责任。
          </p>
          <p>
            2．用户不得将账号借予他人或多人共同使用一个账号。如果发现或者有正当的理由怀疑多人共用一个帐号的现象，和盛天元保留结束或终止该账号的权利。
          </p>
          <p>
            3．和盛天元不对用户所发布信息的删除或储存失败负责。和盛天元有判定用户的行为是否符合和盛天元服务条款的要求的保留权利，如果用户违背了服务条款的规定，和盛天元有中断对其提供网络服务的权利。
          </p>
          <h1>四、和盛天元的权利和义务</h1>
          <p>
            1．和盛天元有义务在现有技术上维护整个平台的正常运行，并努力提升和改进技术，使用户的在线报名活动得以顺利进行。和盛天元提供的网络服务内容包括：文字、软件、声音、图片、录像、图表、邮件及广告中的全部内容，和盛天元拥有以上内容的完全版权，严禁任何个人或单位在未经和盛天元许可的情况下对这些内容进行翻版、复制、转载、篡改等一切用于商业活动的行为。
          </p>
          <p>
            2．对于用户在和盛天元平台上的不当行为或其它任何和盛天元认为应当终止服务的情况，和盛天元有权随时作出删除相关信息、终止服务提供等处理，而无须征得用户的同意；和盛天元应本着诚实信用的原则向用户提供在线报名服务，不得随意中断或停止提供该项服务。
          </p>
          <h1>五、开始、结束服务</h1>
          <p>
            1．用户登录完成后，享受和盛天元提供的各类咨询、信息查询等多重免费服务。如需使用和盛天元的在线课程报名服务，付费经确认后，和盛天元会开通相应的服务权限（服务权限是指用户享受所购买服务的资格）。具体服务内容开通的时间和进度以平台的最新课程信息为准。
          </p>
          <p>
            2．结束服务后，用户使用相应服务权限的权利马上终止。从该时起，用户没有权利，和盛天元也没有义务传送任何未处理的信息或未完成的服务给用户或第三方。
          </p>
          <h1>六、关于课程的说明</h1>
          <p>
            1．和盛天元付费课程一经购买（包括网上支付、邮局汇款、银行电汇、报名点缴费、向第三方贷款分期支付等各种购买方式），都不允许任何形式的退换。
          </p>
          <p>
            2．用户缴费为和盛天元课程的报名费，不包含用户的上网电话费、上网信息费等。
          </p>
          <p>
            3．所有类型的课程都有有效期，用户应在指定日期参加课程学习。如果用户没有在指定日期参加课程学习，课程学习权限将作自动作废处理，用户自己应对此承担全部责任。
          </p>
          <h1>七、用户承担的责任</h1>
          <p>
            1．和盛天元所有用户需自备上网所需要的设备，自行承担上网产生的各项费用。使用自己的电脑能够顺利地接入国际互联网，并能访问本网站主页。
          </p>
          <p>
            2．用户需提供详尽、准确的个人资料并及时更新。若用户提供任何错误、不实、过时或不完整的资料为和盛天元所知，或者和盛天元有合理理由怀疑资料为错误、不实、过时或不完整，和盛天元保留结束或终止其用户登录资格的权利。和盛天元承诺不对外透露用户信息，除以下情况外：
            <br />
            （1）用户授权和盛天元透露这些信息。
            <br />
            （2）相应的法律及程序要求和盛天元提供用户的个人资料。如果用户提供的资料包含有不正确的信息，和盛天元保留结束用户使用网络服务资格的权利。
          </p>
          <p>
            3．通过向第三方贷款分期支付方式购买课程的用户，需仔细阅读并遵守相关风险告知书的内容。
          </p>
          <p>
            4．用户必须遵守中华人民共和国的法律、法规、规章、条例、以及其他具有法律效力的规范，不使用网络服务做任何非法用途。
          </p>
          <p>5．不得干扰或混乱网络服务。</p>
          <p> 6．不得侵犯和盛天元所有著作权、版权。</p>
          <p>
            7．不得将广告、促销资料等，通过上载、张贴、发送电子邮件或以其他方式传送，供前述目的使用的专用区域除外。
          </p>
          <p>
            8．不得在和盛天元内发布违法信息，用户对其发布的内容单独承担法律责任。
          </p>
          <p>
            9．严禁发表、散布、传播任何反动、色情及违反国家安全、扰乱社会秩序等有害信息，用户需对自己在网上的行为承担法律责任。用户若在和盛天元上散布和传播反动、色情或其他违反国家法律的信息，和盛天元的系统记录将作为用户违反法律的证据。
          </p>
          <h1>八、免责条款</h1>
          <p>
            1．和盛天元不保证（包括但不限于）：
            <br />
            （1）服务不受干扰，及时、安全、可靠或不出现任何错误；
            <br />
            （2）用户经由本服务取得的任何产品、服务或其他材料符合用户的期望。
          </p>
          <p>
            2．由于地震、台风、洪水、火灾、战争、政府禁令以及其他不能预见并且对其发生和后果不能防止或避免的不可抗力或互联网上的黑客攻击事件，致使影响和盛天元服务履行的，和盛天元不承担责任。
          </p>
          <p>
            3．当和盛天元以链接形式推荐其他网站内容时，由于和盛天元并不控制相关网站和资源，因此访问者需理解并同意，和盛天元并不对这些网站或资源的可用性负责，且不保证从这些网站获取的任何内容、产品、服务或其他材料的真实性、合法性，对于任何因使用或信赖从此类网站或资源上获取的内容、产品、服务或其他材料而造成（或声称造成）的任何直接或间接损失，和盛天元均不承担任何责任。
          </p>
          <p>
            4．任何由于黑客攻击、计算机病毒侵入或发作、因政府管制而造成的暂时性关闭等影响网络正常经营的不可抗力而造成的个人资料泄露、丢失、被盗用、被窜改或不能正常看课等，和盛天元均得免责。
          </p>
          <p>
            5．和盛天元如因系统维护或升级而需暂停服务时，将事先公告。若因线路及非本公司控制范围外的硬件故障或其它不可抗力而导致暂停服务，于暂停服务期间造成的一切不便与损失，和盛天元不负任何责任。
          </p>
          <p>
            6．和盛天元使用者因违反本声明的规定而触犯中华人民共和国法律的，一切后果自己负责，本网站不承担任何责任。本用户协议根据现行中华人民共和国法律法规制定。如发生协议条款与中华人民共和国法律法规相抵触时，则这些条款将完全按法律法规的规定重新解释，本用户协议的其它条款仍对和盛天元和用户具有法律约束力。
          </p>
          <p className="Iknow">
            本人已清楚知晓上述信息，理解自身享有的权利和应承担的义务，不会以格式条款为由拒绝履行义务。
          </p>
        </div>
      </Wrapper>
    );
  }
}

export default ServiceAgreement;
